# 기본

#1.입력 받은 숫자를 a라는 변수에 저장한 뒤, a의 3제곱 값을 출력하는 프로그램을 작성하세요.


#2.입력 받은 숫자의 나머지를 출력하는 프로그램을 작성하세요.


#3.두 수를 입력 받아 각각 변수 a와 b에 저장한 뒤, a를 b로 나누어 몫만 출력하세요.


#4.'작은 따옴표가 들어간 string'
#   위 내용을 작은 따옴표도 포함하여 출력하세요.


#5."큰 따옴표가 들어간 string"
#   위 내용을 큰 따옴표도 포함하여 출력하세요.


#6.성과 이름을 각각 입력 받은 뒤, 이를 하나의 string으로 합쳐 출력하세요.


#7.myTuple = (1, 2, 3)이란 myTuple 변수가 있다고 할 때, myTuple에 숫자 4를 추가하여 (1, 2, 3, 4)가 되게 하세요.


#8.정수를 입력 받아 변수 a에 저장하세요. a를 출력하되, 음수라면 양수로 바꾸어 출력되게 하세요.


#9.입력 받은 숫자를 입력 받은 횟수만큼 더한 뒤, 그 결과값을 출력하는 프로그램을 작성하세요.
#   단, 만약 결과값이 999를 초과했다면 결과값을 999로 바뀌게 하세요.


#10.입력 받은 숫자가 짝수인지 홀수인지를 알려주는 프로그램을 작성하세요.


#11.두 점 (x1, y1), (x2, y2) 사이의 거리를 구하는 프로그램을 작성하세요.
#   x1, y1, x2, y2는 각각 사용자로부터 입력을 받아야 합니다.


#12.사용자로부터 입력을 받아서 이를 sample에 저장하세요.
#   그리고 sample속에서 콤마(,)로 구분된 내용을 각각 분리하여 List에 저장하고, 이를 출력하는 프로그램을 작성하세요.
#   가령 sample의 내용이 3,6,7,9라면 [3, 6, 7, 9]라는 List가 만들어져야 합니다.


#13.구구단 중에서 짝수 단(2단, 4단, 6단, 8단)만 출력하는 프로그램을 작성하세요.
#   단, 2단은 2×2까지, 4단은 4×4까지, 6단은 6×6까지, 8단은 8×8까지 출력되도록 하세요.


#14.다음 식을 만족하는 모든 X와 Y를 구하는 프로그램을 작성하세요.
#   XY + YX = 99    예) X = 2, Y = 7
